# ApplicationEntryPoint Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ApplicationEntryPoint Class
Members See Also
---
For Revit Macros use only.
**Namespace:** Autodesk.Revit.UI.Macros**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class ApplicationEntryPoint : UIApplication,
	IEntryPoint
```

Visual Basic
---
```text
Public MustInherit Class ApplicationEntryPoint _
	Inherits UIApplication _
	Implements IEntryPoint
```

Visual C++
---
```text
public ref class ApplicationEntryPoint abstract : public UIApplication,
	IEntryPoint
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..UIApplication Autodesk.Revit.UI.Macros..::..ApplicationEntryPoint
# See Also
ApplicationEntryPoint Members
Autodesk.Revit.UI.Macros Namespace